## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_ssm_parameter.airtable_api_key`           |
|        | `aws_ssm_parameter.airtable_base`              |
|        | `aws_ssm_parameter.cra_airtable_base`          |
|        | `aws_ssm_parameter.google_service_account_key` |
|        | `aws_ssm_parameter.health_airtable_base`       |
|        | `aws_ssm_parameter.ircc_airtable_base`         |
|        | `aws_ssm_parameter.mongodb_uri`                |
|        | `aws_ssm_parameter.travel_airtable_base`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.airtable_api_key will be created
  + resource "aws_ssm_parameter" "airtable_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AirTable API key for feedback cronjob"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/airtable-api-key"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-airtable-api-key"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-airtable-api-key"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.airtable_base will be created
  + resource "aws_ssm_parameter" "airtable_base" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Main Airtable base ID"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/airtable-base"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-airtable-base"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-airtable-base"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cra_airtable_base will be created
  + resource "aws_ssm_parameter" "cra_airtable_base" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "CRA Airtable base ID"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/cra-airtable-base"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-cra-airtable-base"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-cra-airtable-base"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.google_service_account_key will be created
  + resource "aws_ssm_parameter" "google_service_account_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Google Service Account key for Google Sheets API"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/google-service-account-key"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-google-service-account-key"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-google-service-account-key"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.health_airtable_base will be created
  + resource "aws_ssm_parameter" "health_airtable_base" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Health Airtable base ID"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/health-airtable-base"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-health-airtable-base"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-health-airtable-base"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ircc_airtable_base will be created
  + resource "aws_ssm_parameter" "ircc_airtable_base" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "IRCC Airtable base ID"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/ircc-airtable-base"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-ircc-airtable-base"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-ircc-airtable-base"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.mongodb_uri will be created
  + resource "aws_ssm_parameter" "mongodb_uri" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "MongoDB connection URI for feedback cronjob"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/mongodb-uri"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-mongodb-uri"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-mongodb-uri"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.travel_airtable_base will be created
  + resource "aws_ssm_parameter" "travel_airtable_base" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Travel Airtable base ID"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/feedback-cronjob/staging/travel-airtable-base"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-travel-airtable-base"
          + "Product"     = "feedback-cronjob"
        }
      + tags_all       = {
          + "CostCentre"  = "feedback-cronjob-staging"
          + "Environment" = "staging"
          + "Name"        = "feedback-cronjob-travel-airtable-base"
          + "Product"     = "feedback-cronjob"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + airtable_api_key_arn           = (known after apply)
  + airtable_base_arn              = (known after apply)
  + cra_airtable_base_arn          = (known after apply)
  + google_service_account_key_arn = (known after apply)
  + health_airtable_base_arn       = (known after apply)
  + ircc_airtable_base_arn         = (known after apply)
  + mongodb_uri_arn                = (known after apply)
  + travel_airtable_base_arn       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.cra_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.google_service_account_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.health_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.ircc_airtable_base"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.mongodb_uri"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.travel_airtable_base"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
